name: "VGG_ILSVRC_16_layers_fc_reduced"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include{
    phase: TRAIN
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include{
    phase: TEST
  }
}
layer {
  name: "conv1_1"
  bottom: "data"
  top: "conv1_1"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_1"
  bottom: "conv1_1"
  top: "conv1_1"
  type: "ReLU"
}
layer {
  name: "conv1_2"
  bottom: "conv1_1"
  top: "conv1_2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_2"
  bottom: "conv1_2"
  top: "conv1_2"
  type: "ReLU"
}
layer {
  name: "pool1"
  bottom: "conv1_2"
  top: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  bottom: "pool1"
  top: "conv2_1"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_1"
  bottom: "conv2_1"
  top: "conv2_1"
  type: "ReLU"
}
layer {
  name: "conv2_2"
  bottom: "conv2_1"
  top: "conv2_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_2"
  bottom: "conv2_2"
  top: "conv2_2"
  type: "ReLU"
}
layer {
  name: "pool2"
  bottom: "conv2_2"
  top: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  bottom: "pool2"
  top: "conv3_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_1"
  bottom: "conv3_1"
  top: "conv3_1"
  type: "ReLU"
}
layer {
  name: "conv3_2"
  bottom: "conv3_1"
  top: "conv3_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_2"
  bottom: "conv3_2"
  top: "conv3_2"
  type: "ReLU"
}
layer {
  name: "conv3_3"
  bottom: "conv3_2"
  top: "conv3_3"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "relu3_3"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "pool3"
  name: "pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_1"
  bottom: "conv4_1"
  top: "conv4_1"
  type: "ReLU"
}
layer {
  name: "conv4_2"
  bottom: "conv4_1"
  top: "conv4_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_2"
  bottom: "conv4_2"
  top: "conv4_2"
  type: "ReLU"
}
layer {
  name: "conv4_3"
  bottom: "conv4_2"
  top: "conv4_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_3"
  bottom: "conv4_3"
  top: "conv4_3"
  type: "ReLU"
}
layer {
  name: "pool4"
  bottom: "conv4_3"
  top: "pool4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1"
  bottom: "pool4"
  top: "conv5_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_1"
  bottom: "conv5_1"
  top: "conv5_1"
  type: "ReLU"
}
layer {
  name: "conv5_2"
  bottom: "conv5_1"
  top: "conv5_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_2"
  bottom: "conv5_2"
  top: "conv5_2"
  type: "ReLU"
}
layer {
  name: "conv5_3"
  bottom: "conv5_2"
  top: "conv5_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_3"
  bottom: "conv5_3"
  top: "conv5_3"
  type: "ReLU"
}
layer {
  name: "pool5"
  bottom: "conv5_3"
  top: "pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "fc6"
  bottom: "pool5"
  top: "fc6"
  type: "Convolution"
  convolution_param {
    num_output: 1024
    kernel_size: 3
    dilation: 3
    pad: 3
  }
}
layer {
  name: "relu6"
  bottom: "fc6"
  top: "fc6"
  type: "ReLU"
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  bottom: "fc6"
  top: "fc7"
  type: "Convolution"
  convolution_param {
    num_output: 1024
    kernel_size: 1
  }
}
layer {
  name: "relu7"
  bottom: "fc7"
  top: "fc7"
  type: "ReLU"
}
layer {
  name: "drop7"
  bottom: "fc7"
  top: "fc7"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8"
  bottom: "fc7"
  top: "fc8"
  type: "Convolution"
  convolution_param {
    num_output: 1000
    kernel_size: 1
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc8"
  bottom: "label"
  top: "loss/loss"
}
layer {
  name: "accuracy/top1"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy@1"
  include: { phase: TEST }
  accuracy_param {
    top_k: 1
  }
}
layer {
  name: "accuracy/top5"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy@5"
  include: { phase: TEST }
  accuracy_param {
    top_k: 5
  }
}
